In [38]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import numpy as np

%matplotlib inline

In [39]:
url = '/Users/javi/Desktop/Ironhack/Entregas de github/Ironhack-Project-2/Raw data/df_final_demo.txt'
df = pd.read_csv(url)

In [40]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 70609 entries, 0 to 70608
Data columns (total 9 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   client_id         70609 non-null  int64
 1   clnt_tenure_yr    70595 non-null  float64
 2   clnt_tenure_mnth  70595 non-null  float64
 3   clnt_age          70594 non-null  float64
 4   gendr             70595 non-null  object
 5   num_accts         70595 non-null  float64
 6   bal               70595 non-null  float64
 7   calls_6_mnth      70595 non-null  float64
 8   logons_6_mnth     70595 non-null  float64
dtypes: float64(7), int64(1), object(1)
memory usage: 4.8+ MB

In [41]:
df.isna().sum()

client_id            0
clnt_tenure_yr      14
clnt_tenure_mnth    14
clnt_age            15
gendr               14
num_accts           14
bal                 14
calls_6_mnth        14
logons_6_mnth       14
dtype: int64

In [42]:
rows_with_nulls = df[df.isnull().any(axis=1)]

# Display rows with null values
rows_with_nulls

,client_id,clnt_tenure_yr,clnt_tenure_mnth,clnt_age,gendr,num_accts,bal,calls_6_mnth,logons_6_mnth
4164,7402828,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
8316,355337,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
8677,8412164,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
9583,4666211,8.0,106.0,NaN,F,2.0,42550.55,4.0,7.0
13444,2222915,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
18066,4876926,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
25961,5277910,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
28432,7616759,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
35323,8191345,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
43518,1227228,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
46076,8611797,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
47189,5144725,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
49846,1037867,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
63701,1618749,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
66219,6021001,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [43]:
#I'm droppping the 14 rows of client_id that have no values whatsoever.
# Find rows with NaN or null values in specified columns
null_rows = df[df[['clnt_tenure_yr', 'clnt_tenure_mnth', 'clnt_age', 'gendr', 'num_accts', 'bal', 'calls_6_mnth', 'logons_6_mnth']].isnull().all(axis=1)]

# Drop rows where all specified columns are NaN or null
df.drop(null_rows.index, inplace=True)

# Reset index
df.reset_index(drop=True, inplace=True)

In [44]:
# Drop duplicate rows based on specified columns
df.drop_duplicates(inplace=True)

# Reset the index after dropping duplicates
df.reset_index(drop=True, inplace=True)

In [45]:
# Find duplicate client_id values
duplicate_client_ids = df.duplicated(subset=['client_id'], keep=False)

# Select rows with duplicate client_id values
duplicate_rows = df[duplicate_client_ids]

# Display rows with duplicate client_id values
duplicate_rows[['client_id']]

Empty DataFrame
Columns: [client_id]
Index: []

In [46]:
#Fill the age of the client with no age with the mean of the age 
# Calculate the mean age
mean_age = df['clnt_age'].mean()

# Fill missing values in 'clnt_age' with the mean age
df['clnt_age'].fillna(mean_age, inplace=True)

/var/folders/23/ykjhg9v57tn3wfmhgxtgj1s80000gn/T/ipykernel_26488/270730456.py:6: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['clnt_age'].fillna(mean_age, inplace=True)

In [47]:
df.shape

(70595, 9)

In [48]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 70595 entries, 0 to 70594
Data columns (total 9 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   client_id         70595 non-null  int64
 1   clnt_tenure_yr    70595 non-null  float64
 2   clnt_tenure_mnth  70595 non-null  float64
 3   clnt_age          70595 non-null  float64
 4   gendr             70595 non-null  object
 5   num_accts         70595 non-null  float64
 6   bal               70595 non-null  float64
 7   calls_6_mnth      70595 non-null  float64
 8   logons_6_mnth     70595 non-null  float64
dtypes: float64(7), int64(1), object(1)
memory usage: 4.8+ MB

In [49]:
df.rename(columns={'clnt_tenure_yr': 'years_as_client', 
                   'clnt_tenure_mnth': 'months_as_client',
                   'clnt_age': 'age',
                   'gendr': 'gender',
                   'num_accts': 'number_of_accounts',
                   'bal': 'total_balance',
                   'calls_6_mnth': 'calls_in_the_last_6_months',
                   'logons_6_mnth': 'frequency_of_logons_6_months'}, inplace=True)

# Display the DataFrame to verify the changes
df.head()

,client_id,years_as_client,months_as_client,age,gender,number_of_accounts,total_balance,calls_in_the_last_6_months,frequency_of_logons_6_months
0,836976,6.0,73.0,60.5,U,2.0,45105.30,6.0,9.0
1,2304905,7.0,94.0,58.0,U,2.0,110860.30,6.0,9.0
2,1439522,5.0,64.0,32.0,U,2.0,52467.79,6.0,9.0
3,1562045,16.0,198.0,49.0,M,2.0,67454.65,3.0,6.0
4,5126305,12.0,145.0,33.0,F,2.0,103671.75,0.0,3.0

In [50]:
df['gender'].replace('X', 'U', inplace=True)

/var/folders/23/ykjhg9v57tn3wfmhgxtgj1s80000gn/T/ipykernel_26488/2151287737.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['gender'].replace('X', 'U', inplace=True)

In [51]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 70595 entries, 0 to 70594
Data columns (total 9 columns):
 #   Column                        Non-Null Count  Dtype
---  ------                        --------------  -----
 0   client_id                     70595 non-null  int64
 1   years_as_client               70595 non-null  float64
 2   months_as_client              70595 non-null  float64
 3   age                           70595 non-null  float64
 4   gender                        70595 non-null  object
 5   number_of_accounts            70595 non-null  float64
 6   total_balance                 70595 non-null  float64
 7   calls_in_the_last_6_months    70595 non-null  float64
 8   frequency_of_logons_6_months  70595 non-null  float64
dtypes: float64(7), int64(1), object(1)
memory usage: 4.8+ MB

In [59]:
# Save the corrected DataFrame to a CSV file
df.to_csv('/Users/javi/Desktop/Ironhack/Entregas de github/Ironhack-Project-2/Raw data/df_final_demo_cleaned.csv', index=False,encoding='latin-1')

In [53]:
url = '/Users/javi/Desktop/Ironhack/Entregas de github/Ironhack-Project-2/Raw data/df_final_demo_cleaned.csv'
df_final = pd.read_csv(url)

In [58]:
df_final.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 70595 entries, 0 to 70594
Data columns (total 9 columns):
 #   Column                        Non-Null Count  Dtype
---  ------                        --------------  -----
 0   client_id                     70595 non-null  int64
 1   years_as_client               70595 non-null  float64
 2   months_as_client              70595 non-null  float64
 3   age                           70595 non-null  float64
 4   gender                        70595 non-null  object
 5   number_of_accounts            70595 non-null  float64
 6   total_balance                 70595 non-null  float64
 7   calls_in_the_last_6_months    70595 non-null  float64
 8   frequency_of_logons_6_months  70595 non-null  float64
dtypes: float64(7), int64(1), object(1)
memory usage: 4.8+ MB

In [55]:

df_final['frequency_of_logons_6_months']

0        9.0
1        9.0
2        9.0
3        6.0
4        3.0
        ...
70590    5.0
70591    6.0
70592    3.0
70593    4.0
70594    7.0
Name: frequency_of_logons_6_months, Length: 70595, dtype: float64

In [56]:
url2 = ('/Users/javi/Desktop/Ironhack/Entregas de github/Ironhack-Project-2/Raw data/df_final_demo_cleaned.csv')
df1 = pd.read_csv(url2)

In [60]:
df1.head()

,client_id,years_as_client,months_as_client,age,gender,number_of_accounts,total_balance,calls_in_the_last_6_months,frequency_of_logons_6_months
0,836976,6.0,73.0,60.5,U,2.0,45105.30,6.0,9.0
1,2304905,7.0,94.0,58.0,U,2.0,110860.30,6.0,9.0
2,1439522,5.0,64.0,32.0,U,2.0,52467.79,6.0,9.0
3,1562045,16.0,198.0,49.0,M,2.0,67454.65,3.0,6.0
4,5126305,12.0,145.0,33.0,F,2.0,103671.75,0.0,3.0